//: [Previous](@previous)

import Foundation

func newPePbScore(industry:String) -> (peScore: Double, pbScore:Double) {
    switch industry {
    case "煤炭":
        return  (5,   0.5)
    case "电力":
        return  (8,   0.8)
    case "石油":
        return  (6,   0.6)
    case "钢铁-普银":
        return   (4,   0.4)
    case "钢铁":
        return   (5,   0.5)
    case "钢铁-钢力":
        return   (7,   0.6)
    case "有色":
        return  (8,   0.8)
    case "化纤":
        return  (8,   0.8)
    case "化工":
        return  (7,   0.7)
    case "建材":
        return  (5,   0.5)
    case "造纸":
        return  (8,   0.6)
    case "矿物制品":
        return    (10,  1)
    case "日用化工":
        return    (10,  1)
    case "农林牧渔":
        return    (10,  1)
    case "纺织服饰":
        return    (8,   0.8)
    case "服饰":
        return  (6,   0.7)
    case "食品饮料":
        return    (10,  1)
    case "酿酒":
        return  (10,  1)
    case "家用电器":
        return    (6,   0.6)
    case "汽车类":
        return (8,   0.8)
    case "医疗保健":
        return    (10,  1)
    case "家居用品":
        return    (8,   0.9)
    case "医药":
        return  (10,  1)
    case "商业连锁":
        return    (8,   0.8)
    case "商贸代理":
        return    (7,   0.7)
    case "传媒娱乐":
        return    (7,   0.7)
    case "广告包装":
        return    (10,  1)
    case "文教休闲":
        return    (10,  1)
    case "酒店餐饮":
        return    (10,  1)
    case "旅游":
        return  (10,  1)
    case "航空":
        return  (10,  1)
    case "船舶":
        return  (10,  1)
    case "运输设备":
        return    (9,   0.7)
    case "通用机械":
        return    (10,  1)
    case "工业机械":
        return    (9,   0.8)
    case "电气设备":
        return    (10,  1)
    case "工程机械":
        return    (8,   0.8)
    case "电器仪表":
        return    (8,   0.8)
    case "电信运营":
        return    (10,  1)
    case "公共交通":
        return    (8,   0.8)
    case "水务":
        return  (8,   0.7)
    case "供气供热":
        return    (10,  1)
    case "环境保护":
        return    (10,  0.8)
    case "运输服务":
        return    (7,   0.7)
    case "仓储物流":
        return    (6,   0.5)
    case "交通设施":
        return    (6,   0.6)
    case "银行":
        return  (4,   0.4)
    case "证券":
        return  (10,  0.9)
    case "保险":
        return  (8,   0.8)
    case "多元金融":
        return    (5,   0.5)
    case "建筑":
        return  (4,   0.4)
    case "房地产":
        return (5,   0.5)
    case "IT设备":
        return    (10,  1)
    case "通信设备":
        return    (10,  1)
    case "半导体":
        return (10,  1)
    case "元器件":
        return (10,  1)
    case "软件服务":
        return    (10,  1)
    case "互联网":
        return (10,  1)
    case "综合类":
        return (10,  1)
    default:
        return (10, 1)
    }
}

//func caculateNewScore(value:[]) -> void{
func caculateNewScore(_ excel:[[String:String]]){
    print("名称,PETTM,PB,百分位,代码,行业,PE分数,PB分数,百分位分数,总分,当前标尺")
    for dic in excel {
        
        if let name = dic["名称"],let pe = dic["PETTM"],let pb = dic["PB"],let score = dic["(([1]-[2])/[2])"],let code = dic["代码"],let ind = dic["行业"] {
            let newScore = newPePbScore(industry: ind)
            
            //PE
            let peScore:Double
            let pe_unwrap = Double(pe) ?? 10
            if pe_unwrap < newScore.peScore{
                peScore = 100
            }else{
                peScore = (1 - (pe_unwrap - newScore.peScore)/newScore.peScore)*100
            }
            
            //PB
            let pbScore:Double
            let pb_unwrap = Double(pb) ?? 1
            if pb_unwrap < newScore.pbScore{
                pbScore = 100
            }else{
                pbScore = (1 - (pb_unwrap - newScore.pbScore)/newScore.pbScore)*100
            }
            
            //%
            let scoreScore:Double
            let score_unwrap = Double(score) ?? 0
            scoreScore = 100 * (1-score_unwrap)
            
            print("\(name),\(pe),\(pb),\(score),\(code),\(ind),\(peScore),\(pbScore),\(scoreScore),\(peScore+pbScore+scoreScore),\(newScore.peScore) \(newScore.pbScore)")
        }else{
            print("解析失败 \(dic)")
        }
    }
}

let data: [[String: String]] = [
    ["名称": "山东路桥", "PETTM": "3.76", "PB": "0.62", "(([1]-[2])/[2])": "0.22", "代码": "498", "行业": "建筑"],
    ["名称": "贵阳银行", "PETTM": "4.06", "PB": "0.36", "(([1]-[2])/[2])": "0.26", "代码": "601997", "行业": "银行"],
    ["名称": "中国中铁", "PETTM": "4.92", "PB": "0.50", "(([1]-[2])/[2])": "0.21", "代码": "601390", "行业": "建筑"],
    ["名称": "中国铁建", "PETTM": "5.20", "PB": "0.45", "(([1]-[2])/[2])": "0.28", "代码": "601186", "行业": "建筑"],
    ["名称": "浙商银行", "PETTM": "5.20", "PB": "0.46", "(([1]-[2])/[2])": "0.21", "代码": "601916", "行业": "银行"],
    ["名称": "江阴银行", "PETTM": "5.31", "PB": "0.59", "(([1]-[2])/[2])": "0.29", "代码": "2807", "行业": "银行"],
    ["名称": "安徽建工", "PETTM": "5.33", "PB": "0.74", "(([1]-[2])/[2])": "0.19", "代码": "600502", "行业": "建筑"],
    ["名称": "民生银行", "PETTM": "5.40", "PB": "0.32", "(([1]-[2])/[2])": "0.29", "代码": "600016", "行业": "银行"],
    ["名称": "无锡银行", "PETTM": "5.49", "PB": "0.61", "(([1]-[2])/[2])": "0.26", "代码": "600908", "行业": "银行"],
    ["名称": "张家港行", "PETTM": "5.49", "PB": "0.66", "(([1]-[2])/[2])": "0.21", "代码": "2839", "行业": "银行"],
    ["名称": "瑞丰银行", "PETTM": "5.59", "PB": "0.60", "(([1]-[2])/[2])": "0.26", "代码": "601528", "行业": "银行"],
    ["名称": "厦门银行", "PETTM": "5.72", "PB": "0.58", "(([1]-[2])/[2])": "0.28", "代码": "601187", "行业": "银行"],
    ["名称": "同德化工", "PETTM": "5.92", "PB": "0.91", "(([1]-[2])/[2])": "0.22", "代码": "2360", "行业": "化工"],
    ["名称": "郑煤机", "PETTM": "5.93", "PB": "1.04", "(([1]-[2])/[2])": "0.21", "代码": "601717", "行业": "工业机械"],
    ["名称": "青农商行", "PETTM": "5.99", "PB": "0.46", "(([1]-[2])/[2])": "0.27", "代码": "2958", "行业": "银行"],
    ["名称": "紫金银行", "PETTM": "6.21", "PB": "0.52", "(([1]-[2])/[2])": "0.20", "代码": "601860", "行业": "银行"],
    ["名称": "西安银行", "PETTM": "6.24", "PB": "0.48", "(([1]-[2])/[2])": "0.21", "代码": "600928", "行业": "银行"],
    ["名称": "晋控煤业", "PETTM": "6.69", "PB": "1.22", "(([1]-[2])/[2])": "0.27", "代码": "601001", "行业": "煤炭"],
    ["名称": "淮北矿业", "PETTM": "6.81", "PB": "0.86", "(([1]-[2])/[2])": "0.04", "代码": "600985", "行业": "煤炭"],
    ["名称": "洲际油气", "PETTM": "6.92", "PB": "1.15", "(([1]-[2])/[2])": "0.16", "代码": "600759", "行业": "石油"],
    ["名称": "浙江交科", "PETTM": "7.01", "PB": "0.68", "(([1]-[2])/[2])": "0.27", "代码": "2061", "行业": "建筑"],
    ["名称": "中国电建", "PETTM": "7.13", "PB": "0.64", "(([1]-[2])/[2])": "0.18", "代码": "601669", "行业": "建筑"],
    ["名称": "兰州银行", "PETTM": "7.13", "PB": "0.46", "(([1]-[2])/[2])": "0.14", "代码": "1227", "行业": "银行"],
    ["名称": "新疆众和", "PETTM": "7.39", "PB": "0.90", "(([1]-[2])/[2])": "0.16", "代码": "600888", "行业": "有色"],
    ["名称": "华域汽车", "PETTM": "7.55", "PB": "0.87", "(([1]-[2])/[2])": "0.26", "代码": "600741", "行业": "汽车类"],
    ["名称": "物产中大", "PETTM": "7.61", "PB": "0.67", "(([1]-[2])/[2])": "0.26", "代码": "600704", "行业": "仓储物流"],
    ["名称": "柳药集团", "PETTM": "7.62", "PB": "0.89", "(([1]-[2])/[2])": "0.17", "代码": "603368", "行业": "商业连锁"],
    ["名称": "平煤股份", "PETTM": "7.85", "PB": "0.93", "(([1]-[2])/[2])": "0.18", "代码": "601666", "行业": "煤炭"],
    ["名称": "恒源煤电", "PETTM": "7.91", "PB": "0.85", "(([1]-[2])/[2])": "0.06", "代码": "600971", "行业": "煤炭"],
    ["名称": "常宝股份", "PETTM": "7.95", "PB": "0.84", "(([1]-[2])/[2])": "0.22", "代码": "2478", "行业": "钢铁"],
    ["名称": "中材国际", "PETTM": "8.14", "PB": "1.19", "(([1]-[2])/[2])": "0.07", "代码": "600970", "行业": "建筑"],
    ["名称": "江河集团", "PETTM": "8.48", "PB": "0.84", "(([1]-[2])/[2])": "0.28", "代码": "601886", "行业": "建筑"],
    ["名称": "山东海化", "PETTM": "8.73", "PB": "0.91", "(([1]-[2])/[2])": "0.17", "代码": "822", "行业": "化工"],
    ["名称": "中国中冶", "PETTM": "8.81", "PB": "0.63", "(([1]-[2])/[2])": "0.22", "代码": "601618", "行业": "建筑"],
    ["名称": "中煤能源", "PETTM": "8.85", "PB": "1.03", "(([1]-[2])/[2])": "0.22", "代码": "601898", "行业": "煤炭"],
    ["名称": "物产环能", "PETTM": "8.92", "PB": "1.28", "(([1]-[2])/[2])": "0.18", "代码": "603071", "行业": "商业连锁"],
    ["名称": "华阳股份", "PETTM": "9.02", "PB": "0.89", "(([1]-[2])/[2])": "0.07", "代码": "600348", "行业": "煤炭"],
    ["名称": "天健集团", "PETTM": "9.04", "PB": "0.66", "(([1]-[2])/[2])": "0.24", "代码": "90", "行业": "建筑"],
    ["名称": "津滨发展", "PETTM": "9.27", "PB": "1.21", "(([1]-[2])/[2])": "0.25", "代码": "897", "行业": "房地产"],
    ["名称": "福能股份", "PETTM": "9.43", "PB": "1.11", "(([1]-[2])/[2])": "0.25", "代码": "600483", "行业": "电力"],
    ["名称": "常熟汽饰", "PETTM": "9.46", "PB": "0.99", "(([1]-[2])/[2])": "0.21", "代码": "603035", "行业": "汽车类"],
    ["名称": "龙建股份", "PETTM": "9.47", "PB": "1.25", "(([1]-[2])/[2])": "0.29", "代码": "600853", "行业": "建筑"],
    ["名称": "中钢国际", "PETTM": "9.52", "PB": "1.06", "(([1]-[2])/[2])": "0.27", "代码": "928", "行业": "建筑"],
    ["名称": "皖能电力", "PETTM": "9.57", "PB": "1.06", "(([1]-[2])/[2])": "0.19", "代码": "543", "行业": "电力"],
    ["名称": "北方国际", "PETTM": "9.59", "PB": "1.06", "(([1]-[2])/[2])": "0.14", "代码": "65", "行业": "建筑"],
    ["名称": "上海电力", "PETTM": "9.60", "PB": "1.24", "(([1]-[2])/[2])": "0.25", "代码": "600021", "行业": "电力"],
    ["名称": "天地科技", "PETTM": "9.61", "PB": "1.03", "(([1]-[2])/[2])": "0.20", "代码": "600582", "行业": "工程机械"],
    ["名称": "三角轮胎", "PETTM": "9.62", "PB": "0.89", "(([1]-[2])/[2])": "0.27", "代码": "601163", "行业": "汽车类"],
    ["名称": "中国外运", "PETTM": "9.67", "PB": "0.98", "(([1]-[2])/[2])": "0.24", "代码": "601598", "行业": "仓储物流"],
    ["名称": "贵州轮胎", "PETTM": "9.68", "PB": "0.85", "(([1]-[2])/[2])": "0.14", "代码": "589", "行业": "汽车类"],
    ["名称": "江苏国信", "PETTM": "9.75", "PB": "0.86", "(([1]-[2])/[2])": "0.21", "代码": "2608", "行业": "电力"],
    ["名称": "浙能电力", "PETTM": "9.90", "PB": "1.00", "(([1]-[2])/[2])": "0.19", "代码": "600023", "行业": "电力"],
    ["名称": "航民股份", "PETTM": "10.07", "PB": "1.14", "(([1]-[2])/[2])": "0.26", "代码": "600987", "行业": "纺织服饰"],
    ["名称": "上港集团", "PETTM": "10.08", "PB": "1.05", "(([1]-[2])/[2])": "0.22", "代码": "600018", "行业": "交通设施"],
    ["名称": "创业环保", "PETTM": "10.10", "PB": "0.93", "(([1]-[2])/[2])": "0.28", "代码": "600874", "行业": "环境保护"],
    ["名称": "华菱钢铁", "PETTM": "10.17", "PB": "0.52", "(([1]-[2])/[2])": "0.22", "代码": "932", "行业": "钢铁"],
    ["名称": "华电国际", "PETTM": "10.19", "PB": "1.27", "(([1]-[2])/[2])": "0.07", "代码": "600027", "行业": "电力"],
    ["名称": "旺能环境", "PETTM": "10.20", "PB": "0.92", "(([1]-[2])/[2])": "0.27", "代码": "2034", "行业": "环境保护"],
    ["名称": "国药一致", "PETTM": "10.22", "PB": "0.83", "(([1]-[2])/[2])": "0.14", "代码": "28", "行业": "商业连锁"],
    ["名称": "嘉化能源", "PETTM": "10.25", "PB": "1.09", "(([1]-[2])/[2])": "0.22", "代码": "600273", "行业": "化工"],
    ["名称": "厦门象屿", "PETTM": "10.31", "PB": "1.02", "(([1]-[2])/[2])": "0.28", "代码": "600057", "行业": "仓储物流"],
    ["名称": "中孚实业", "PETTM": "10.38", "PB": "0.78", "(([1]-[2])/[2])": "0.26", "代码": "600595", "行业": "有色"],
    ["名称": "江苏金租", "PETTM": "10.56", "PB": "1.29", "(([1]-[2])/[2])": "0.28", "代码": "600901", "行业": "多元金融"],
    ["名称": "中铁工业", "PETTM": "10.58", "PB": "0.70", "(([1]-[2])/[2])": "0.18", "代码": "600528", "行业": "运输设备"],
    ["名称": "云图控股", "PETTM": "10.60", "PB": "1.03", "(([1]-[2])/[2])": "0.25", "代码": "2539", "行业": "化工"],
    ["名称": "浦东建设", "PETTM": "10.64", "PB": "0.74", "(([1]-[2])/[2])": "0.25", "代码": "600284", "行业": "建筑"],
    ["名称": "河钢资源", "PETTM": "10.67", "PB": "0.92", "(([1]-[2])/[2])": "0.13", "代码": "923", "行业": "钢铁"],
    ["名称": "广东建工", "PETTM": "10.69", "PB": "1.00", "(([1]-[2])/[2])": "0.16", "代码": "2060", "行业": "建筑"],
    ["名称": "中新集团", "PETTM": "10.83", "PB": "0.75", "(([1]-[2])/[2])": "0.17", "代码": "601512", "行业": "房地产"],
    ["名称": "江西铜业", "PETTM": "10.84", "PB": "0.94", "(([1]-[2])/[2])": "0.29", "代码": "600362", "行业": "有色"],
    ["名称": "中国能建", "PETTM": "10.87", "PB": "0.90", "(([1]-[2])/[2])": "0.12", "代码": "601868", "行业": "建筑"],
    ["名称": "特变电工", "PETTM": "10.91", "PB": "0.95", "(([1]-[2])/[2])": "0.04", "代码": "600089", "行业": "电气设备"],
    ["名称": "宝新能源", "PETTM": "10.96", "PB": "0.76", "(([1]-[2])/[2])": "0.12", "代码": "690", "行业": "电力"],
    ["名称": "创力集团", "PETTM": "11.04", "PB": "0.88", "(([1]-[2])/[2])": "0.28", "代码": "603012", "行业": "工业机械"],
    ["名称": "嘉泽新能", "PETTM": "11.09", "PB": "1.15", "(([1]-[2])/[2])": "0.22", "代码": "601619", "行业": "电力"],
    ["名称": "英特集团", "PETTM": "11.20", "PB": "1.22", "(([1]-[2])/[2])": "0.28", "代码": "411", "行业": "商业连锁"],
    ["名称": "山西焦煤", "PETTM": "11.30", "PB": "1.22", "(([1]-[2])/[2])": "0.12", "代码": "983", "行业": "煤炭"],
    ["名称": "秦港股份", "PETTM": "11.33", "PB": "0.93", "(([1]-[2])/[2])": "0.26", "代码": "601326", "行业": "交通设施"],
    ["名称": "三峰环境", "PETTM": "11.34", "PB": "1.22", "(([1]-[2])/[2])": "0.25", "代码": "601827", "行业": "环境保护"],
    ["名称": "辰欣药业", "PETTM": "11.37", "PB": "1.03", "(([1]-[2])/[2])": "0.24", "代码": "603367", "行业": "医药"],
    ["名称": "九安医疗", "PETTM": "11.37", "PB": "1.02", "(([1]-[2])/[2])": "0.24", "代码": "2432", "行业": "医疗保健"],
    ["名称": "联泰环保", "PETTM": "11.56", "PB": "0.71", "(([1]-[2])/[2])": "0.29", "代码": "603797", "行业": "环境保护"],
    ["名称": "通宝能源", "PETTM": "11.64", "PB": "0.81", "(([1]-[2])/[2])": "0.10", "代码": "600780", "行业": "电力"],
    ["名称": "甘肃能化", "PETTM": "11.68", "PB": "0.85", "(([1]-[2])/[2])": "0.19", "代码": "552", "行业": "煤炭"],
    ["名称": "兰花科创", "PETTM": "11.75", "PB": "0.73", "(([1]-[2])/[2])": "0.08", "代码": "600123", "行业": "煤炭"],
    ["名称": "精工钢构", "PETTM": "11.92", "PB": "0.67", "(([1]-[2])/[2])": "0.26", "代码": "600496", "行业": "钢铁"],
    ["名称": "中文传媒", "PETTM": "12.01", "PB": "0.96", "(([1]-[2])/[2])": "0.06", "代码": "600373", "行业": "传媒娱乐"],
    ["名称": "金牌家居", "PETTM": "12.02", "PB": "1.08", "(([1]-[2])/[2])": "0.27", "代码": "603180", "行业": "家居用品"],
    ["名称": "潞安环能", "PETTM": "12.09", "PB": "0.89", "(([1]-[2])/[2])": "0.08", "代码": "601699", "行业": "煤炭"],
    ["名称": "玲珑轮胎", "PETTM": "12.10", "PB": "1.19", "(([1]-[2])/[2])": "0.18", "代码": "601966", "行业": "汽车类"],
    ["名称": "九州通", "PETTM": "12.10", "PB": "1.00", "(([1]-[2])/[2])": "0.13", "代码": "600998", "行业": "商业连锁"],
    ["名称": "海油工程", "PETTM": "12.12", "PB": "0.93", "(([1]-[2])/[2])": "0.15", "代码": "600583", "行业": "石油"],
    ["名称": "华光环能", "PETTM": "12.15", "PB": "1.00", "(([1]-[2])/[2])": "0.19", "代码": "600475", "行业": "环境保护"],
    ["名称": "旗滨集团", "PETTM": "12.21", "PB": "1.11", "(([1]-[2])/[2])": "0.19", "代码": "601636", "行业": "建材"],
    ["名称": "华新水泥", "PETTM": "12.26", "PB": "0.86", "(([1]-[2])/[2])": "0.21", "代码": "600801", "行业": "建材"],
    ["名称": "太阳能", "PETTM": "12.30", "PB": "0.74", "(([1]-[2])/[2])": "0.14", "代码": "591", "行业": "电力"],
    ["名称": "鄂尔多斯", "PETTM": "12.33", "PB": "1.24", "(([1]-[2])/[2])": "0.16", "代码": "600295", "行业": "钢铁"],
    ["名称": "双箭股份", "PETTM": "12.35", "PB": "1.27", "(([1]-[2])/[2])": "0.26", "代码": "2381", "行业": "化工"],
    ["名称": "湖北能源", "PETTM": "12.44", "PB": "0.90", "(([1]-[2])/[2])": "0.24", "代码": "883", "行业": "电力"],
    ["名称": "海容冷链", "PETTM": "12.69", "PB": "1.03", "(([1]-[2])/[2])": "0.19", "代码": "603187", "行业": "通用机械"],
    ["名称": "金开新能", "PETTM": "12.73", "PB": "1.10", "(([1]-[2])/[2])": "0.10", "代码": "600821", "行业": "电力"],
    ["名称": "武进不锈", "PETTM": "12.74", "PB": "1.20", "(([1]-[2])/[2])": "0.21", "代码": "603878", "行业": "钢铁"],
    ["名称": "中盐化工", "PETTM": "12.77", "PB": "0.95", "(([1]-[2])/[2])": "0.25", "代码": "600328", "行业": "化工"],
    ["名称": "白云山", "PETTM": "12.82", "PB": "1.21", "(([1]-[2])/[2])": "0.13", "代码": "600332", "行业": "医药"],
    ["名称": "宇新股份", "PETTM": "12.96", "PB": "1.08", "(([1]-[2])/[2])": "0.17", "代码": "2986", "行业": "化工"],
    ["名称": "节能风电", "PETTM": "12.98", "PB": "1.13", "(([1]-[2])/[2])": "0.23", "代码": "601016", "行业": "电力"]
]


//计算新打分

caculateNewScore(data)

